{
  "name": "Sant'Clear Costa",
  "home": "Início",
  "about": "Sobre",
  "resume": "Currículo",
  "contact": "Contato",
  "designation": "Desenvolvedor (Full-Stack, Mobile e Engenharia de Software)",
  "i-have-xp-in": "10 anos de atuação em corporações de TI.",
  "about-p10": "Desde 2013, venho aprimorando habilidades em desenvolvimento de software e atuando como consultor especializado em desenvolvimento full-stack. Sou tecnólogo em Sistemas de Telecomunicações e domino várias linguagens de programação e frameworks, como Java, JavaScript e Python. Destaco-me por criar soluções únicas, como o aplicativo multiplataforma ",
  "about-p11": " para apostadores de loterias e desenvolver indicadores de análise técnica de ativos para a plataforma Metatrader 5, comercializados no portal ",
  "sinal-sorte": "Sinal da Sorte",
  "mql5-com": "mql5.com",
  "about-p20": "Ao longo da minha carreira, colaborei com organizações renomadas, como Tribunal de Contas de Santa Catarina e Softplan, além do meu atual trabalho com a ACT Digital e Sicoob CCS. Estou sempre em busca de conhecimentos em tecnologias contemporâneas e emergentes para oferecer soluções inovadoras e de excelência.",
  "about-p21": "Valorizo ambientes colaborativos e acredito que o trabalho em equipe e a troca de conhecimentos são cruciais para o avanço no desenvolvimento de software. Sou comprometido com a qualidade, focado em superar expectativas e entregar resultados dentro dos prazos estabelecidos.",
  "birthday": "Aniversário:",
  "age": "Idade:",
  "region": "Região:",
  "phone": "Ligação:",
  "short-description": "Domino uma variedade de tecnologias, com ênfase em Java, Spring Framework, Angular, SQL, HTML e CSS. Destaco-me pela capacidade de adaptação e aprendizado rápido, entregando soluções eficientes e inovadoras. Tenho experiência em desenvolvimento web e integração de sistemas, busco aprimorar continuamente minhas competências e contribuir para o sucesso dos projetos em que atuo.",
  "note": "",
  "degree": "Grau Acadêmico:",
  "degree-title": "Tecnólogo",
  "available": "Disponível",
  "resume": "Currículo",
  "skills": "Habilidades",
  "skills-summary": "1 - Iniciante acadêmico, apenas treinamento | 2 - Nível intermediário 1 + pequenos projetos ou estágios | 3 - Nível avançado 1/2 + experiência em projetos | 4 - Nível profissional 1/2/3 + ampla experiência profissional | 5 - Especialista.",
  "summary": "Sumário",
  "education": "Educação",
  "telecon-degree-course": "Superior de Tecnologia em Sistemas de Telecomunicações",
  "management-degree-course": "Superior de Tecnologia em Gestão da Tecnologia da Informação",
  "incomplete": "* Incompleto",
  "improvement-courses": "Cursos de Aperfeiçoamento",
  "in-progress": "* Em andamento",
  "completed-in": "Concluído em ",
  "hours": "horas",
  "jan": "Janeiro",
  "feb": "Fevereiro",
  "mar": "Março",
  "abr": "Abril",
  "may": "Maio",
  "jun": "Junho",
  "jul": "Julho",
  "aug": "Agosto",
  "sep": "Setembro",
  "oct": "Outubro",
  "nov": "Novembro",
  "dez": "Dezembro",
  "pt": "Português",
  "en": "Inglês",
  "native": "Nativo",
  "a2": "A2 - Básico - Habilidade de leitura",
  "pro-xp": "Experiência Profissional",
  "full-stack-developer": "Desenvolvedor Full-Stack",
  "software-developer": "Desenvolvedor de Sistemas",
  "java-web-programmer": "Programador Java Web",
  "java-implementer-analyst": "Analista Implementador Java",
  "trainee": "Estagiário",
  "alarm-maintenance-tech": "Técnico de manutenção de alarmes",
  "various-positions": "Diversos Cargos",
  "present": "Presente",
  "act-role-p1": "Atuo como consultor de desenvolvimento de software no Sicoob CCS, uma das maiores instituições financeiras do Brasil, através da ACT Digital.",
  "act-role-p2": "Minhas responsabilidades incluem manter e aprimorar o sistema de transferência de crédito do Sicoob CCS, trabalhando no frontend, backend e banco de dados relacionais. Além disso, participo ativamente do planejamento e desenvolvimento de projetos, sempre focado em atender às expectativas dos clientes internos e externos.",
  "act-role-p3": "Integro a equipe responsável pela migração do sistema de portabilidade de crédito antigo para a nova plataforma. Com esforço conjunto, entregamos as etapas dentro do prazo, garantindo a satisfação do nosso cliente, Sicoob CCS. Acredito que minha dedicação e compromisso foram fundamentais para alcançar esses resultados positivos e excelentes feedbacks dos meus gestores, o que demonstra meu comprometimento e qualidade no trabalho.",
  "skills-involved": "Habilidades Envolvidas",
  "g4f-role-p1": "Colaborei como consultor da G4F Soluções Corporativas e PD Case Informática, atuando como Desenvolvedor Full-Stack no cliente Tribunal de Contas de Santa Catarina.",
  "g4f-role-p2": "Minhas responsabilidades incluíam a sustentação do sistema web e-Sfinge, desenvolvendo novos casos de uso e corrigindo módulos de Aposentadoria, Pensão e e-Sfinge Web. Participei da organização de sprints e acompanhamento de tarefas, seguindo metodologias ágeis, e auxiliei as equipes na resolução de impedimentos.",
  "g4f-role-p3": "Durante minha atuação no projeto e-Sfinge, do Tribunal de Contas de Santa Catarina, colaborei na consolidação de informações sobre contas públicas e na ampliação da publicidade das informações. Minha contribuição foi essencial para melhorar a gestão e fiscalização de recursos públicos, garantindo maior transparência e eficiência.",
  "celk-role-p1": "Como Desenvolvedor de Sistemas na CELK Sistemas, trabalhei na otimização do módulo de Vigilância Sanitária do Celk Saúde, um sistema integrado que conecta cidadãos e profissionais à vigilância sanitária municipal e agiliza processos.",
  "celk-role-p2": "Dentre minhas responsabilidades, estavam a manutenção corretiva e evolutiva do sistema, assegurando sua estabilidade e eficiência. Dediquei-me à elaboração de códigos de programação e à estruturação do banco de dados, atendendo aos requisitos solicitados e às necessidades dos usuários, sempre focado na qualidade e na inovação.",
  "celk-role-p3": "Meu trabalho proporcionou a otimização do fluxo de trabalho dos profissionais da vigilância sanitária, agilizando o atendimento das solicitações e reduzindo o tempo para aprovação de documentos. Isso resultou em um serviço mais eficiente e benéfico para os usuários do sistema.",
  "omd-role-p1": "Na OMD Soluções, como principal Desenvolvedor de Sistemas, trabalhei na integração de sistemas por meio do desenvolvimento de APIs webservices e customizei um software web de ouvidorias, que incluía funcionalidades como geração de relatórios, controle de prazos e gerenciamento de informações sigilosas.",
  "omd-role-p2": "Participei tanto da sustentação quanto da evolução do sistema, atuando na criação de scripts de banco de dados relacional e implementação de soluções em ambientes on-premises e em nuvem. Adicionalmente, zelei pela documentação de novas funcionalidades e prestei suporte técnico à equipe sempre que necessário, assegurando a excelência e eficiência do projeto.",
  "omd-role-p3": "Além da remodelagem completa do layout da aplicação, também realizei diversas refatorações que resultaram em um código mais organizado e fácil de manter. Como desenvolvedor, fui responsável por integrações importantes entre as ouvidorias de órgãos regulamentadores, como BACEN, ANS, ANEEL e SUSEP, gerando grande valor para o sistema e facilitando o processo de ouvidoria.",
  "softplan-role-p1": "Na Softplan, atuei como Analista Implementador Java em sistemas ERP voltados à gestão pública. Trabalhei no módulo de Gestão de Contratos e Mediações (SMO) do sistema SIDER, que gerencia contratos e medições de obras e serviços de engenharia, permitindo o acompanhamento de saldos, alterações contratuais e cronogramas de execução.",
  "softplan-role-p2": "Minhas responsabilidades incluíam desde a codificação de novos casos de uso e correção de erros até o desenvolvimento de testes automatizados para garantir a qualidade do software. Além disso, colaborei proativamente na melhoria dos processos de qualidade da empresa, trabalhando em conjunto com a equipe para otimizar a eficiência e o desempenho dos projetos.",
  "softplan-role-p3": "Em apenas 8 meses, destaquei-me como um dos responsáveis por impulsionar melhorias significativas nos processos de qualidade de software da empresa. Posteriormente, fui escalado para trabalhar no desenvolvimento de sistemas web em outro setor durante um ano, onde continuei a contribuir para o sucesso dos projetos e aprimorar minhas habilidades técnicas.",
  "wavetech-role-p1": "Na Wavetech, trabalhei na manutenção de um software de configuração de aparelhos auditivos, garantindo a funcionalidade e usabilidade do sistema para os profissionais da área.",
  "wavetech-role-p2": "Estive envolvido no desenvolvimento de um sistema web de armazenamento de arquivos, empregando metodologias e práticas modernas de desenvolvimento de software. Durante essa experiência, pude expandir meu conhecimento em diversas tecnologias e contribuir para a evolução do projeto, sempre buscando soluções inovadoras e eficientes.",
  "wavetech-role-p3": "Durante meu estágio na Wavetech, aprimorei meu conhecimento técnico em diversos frameworks e tecnologias, colaborando efetivamente para o êxito dos projetos da empresa. Essa experiência me proporcionou uma base sólida para evoluir constantemente na área de desenvolvimento de software, adaptando-me às novas demandas e desafios que surgem no mercado.",
  "ifsc-role-p1": "Estagiário desenvolvedor Android. Iniciei a implementação de um módulo inteligente para auto completar textos digitados em um prompt shell.",
  "khronos-role-p1": "Realizar reparos em sistemas de alarmes residencial in loco.",
  "angeloni-role-p1": "Serviços Gerais de confeitaria, atendente de padaria e operador de caixa."
}
