{
  "name": "Sant'Clear Costa",
  "home": "Home",
  "about": "About",
  "resume": "Resume",
  "contact": "Contact",
  "designation": "Software Engineer",
  "about-p10": "Since 2013, I have been improving my skills in software development and working as a specialized consultant in full-stack development. I hold a degree in Telecommunications Systems and have mastery over several programming languages and frameworks, such as Java, JavaScript, and Python. I excel at creating unique solutions, like the multiplatform application",
  "about-p11": "for lottery bettors and developing technical analysis indicators of assets for the Metatrader 5 platform, marketed on the portal",
  "sinal-sorte": "Sinal da Sorte",
  "mql5-com": "mql5.com",
  "about-p20": "Throughout my career, I have collaborated with renowned organizations, such as the Court of Auditors of Santa Catarina and Softplan, in addition to my current work with ACT Digital and Sicoob CCS. I am always in pursuit of knowledge in contemporary and emerging technologies to provide innovative and excellent solutions.",
  "about-p21": "I value collaborative environments and believe that teamwork and knowledge exchange are crucial for advancing software development. I am committed to quality, focused on exceeding expectations, and delivering results within established deadlines.",
  "birthday": "Birthday:",
  "age": "Age:",
  "region": "Region:",
  "phone": "Call:",
  "short-description": "I master a variety of technologies, with emphasis on Java, Spring Framework, Angular, SQL, HTML, and CSS. I stand out for my adaptability and quick learning, delivering efficient and innovative solutions. I have experience in web development and system integration, constantly seeking to improve my skills and contribute to the success of the projects I work on.",
  "note": "",
  "degree": "Degree:",
  "degree-title": "Technologist",
  "available": "Available",
  "resume": "Resume",
  "skills": "Skills",
  "skills-summary": "1 - Beginner Academic, training only | 2 - Intermediate Level 1 + small projects or internships | 3 - Advanced Level 1/2 + project experience | 4 – Professional Level 1/2/3 + wide professional experience | 5 - Expert.",
  "summary": "Summary",
  "education": "Education",
  "telecon-degree-course": "Higher Education in Telecommunications Systems",
  "management-degree-course": "Higher Education in Information Technology Management",
  "incomplete": "Incomplete",
  "improvement-courses": "Improvement Courses",
  "in-progress": "* In progress",
  "completed-in": "Completed in ",
  "hours": "hours",
  "jan": "January",
  "feb": "February",
  "mar": "March",
  "abr": "April",
  "may": "May",
  "jun": "June",
  "jul": "July",
  "aug": "August",
  "sep": "September",
  "oct": "October",
  "nov": "November",
  "dez": "December",
  "pt": "Portuguese",
  "en": "English",
  "native": "Native",
  "a2": "A2 - Basic - Reading skill",
  "pro-xp": "Professional Experience",
  "full-stack-developer": "Full-Stack Developer",
  "software-developer": "Software Developer",
  "java-web-programmer": "Java Web Programmer",
  "java-implementer-analyst": "Java Implementer Analyst",
  "trainee": "Intern",
  "alarm-maintenance-tech": "Alarm Maintenance Technician",
  "various-positions": "Various Positions",
  "present": "Present",
  "act-role-p1": "I work as a software development consultant at Sicoob CCS, one of the largest financial institutions in Brazil, through ACT Digital.",
  "act-role-p2": "My responsibilities include maintaining and enhancing the Sicoob CCS credit transfer system, working on the frontend, backend, and relational databases. In addition, I actively participate in the planning and development of projects, always focused on meeting the expectations of internal and external customers.",
  "act-role-p3": "I am part of the team responsible for migrating the old credit portability system to the new platform. With joint effort, we delivered the stages within the deadline, ensuring the satisfaction of our client, Sicoob CCS. I believe that my dedication and commitment were fundamental in achieving these positive results and excellent feedback from my managers, which demonstrates my commitment and quality of work.",
  "skills-involved": "Skills Involved",
  "g4f-role-p1": "I collaborated as a consultant for G4F Corporate Solutions and PD Case Informática, working as a Full-Stack Developer for the client Court of Auditors of Santa Catarina.",
  "g4f-role-p2": "My responsibilities included supporting the e-Sfinge web system, developing new use cases, and fixing Retirement, Pension, and e-Sfinge Web modules. I participated in the organization of sprints and task monitoring, following agile methodologies, and assisted teams in resolving impediments.",
  "g4f-role-p3": "During my work on the e-Sfinge project for the Court of Auditors of Santa Catarina, I collaborated in the consolidation of information on public accounts and the expansion of information publicity. My contribution was essential to improve the management and supervision of public resources, ensuring greater transparency and efficiency.",
  "celk-role-p1": "As a Systems Developer at CELK Systems, I worked on optimizing the Health Surveillance module of Celk Health, an integrated system that connects citizens and professionals to municipal health surveillance and streamlines processes.",
  "celk-role-p2": "Among my responsibilities were corrective and evolutionary system maintenance, ensuring its stability and efficiency. I dedicated myself to developing programming codes and structuring the database, meeting the requested requirements and user needs, always focused on quality and innovation.",
  "celk-role-p3": "My work provided the optimization of the workflow for health surveillance professionals, speeding up the processing of requests and reducing the time for document approval. This resulted in a more efficient and beneficial service for system users.",
  "omd-role-p1": "At OMD Solutions, as the main Systems Developer, I worked in systems integration through the development of web APIs and customized a web software for ombudsman offices, which included functionalities such as report generation, deadline control, and management of confidential information.",
  "omd-role-p2": "I participated in both the support and evolution of the system, working on creating relational database scripts and implementing solutions in on-premises and cloud environments. Additionally, I ensured the documentation of new features and provided technical support to the team whenever necessary, ensuring the excellence and efficiency of the project.",
  "omd-role-p3": "In addition to a complete remodeling of the application layout, I also carried out several refactorings that resulted in a more organized and easier-to-maintain code. As a developer, I was responsible for important integrations between ombudsman offices of regulatory agencies, such as BACEN, ANS, ANEEL, and SUSEP, generating great value for the system and facilitating the ombudsman process.",
  "softplan-role-p1": "At Softplan, I worked as a Java Implementer Analyst in ERP systems focused on public management. I worked on the Contract Management and Measurements (SMO) module of the SIDER system, which manages contracts and measurements for engineering works and services, allowing the monitoring of balances, contractual changes, and execution schedules.",
  "softplan-role-p2": "My responsibilities ranged from coding new use cases and fixing errors to developing automated tests to ensure software quality. In addition, I proactively collaborated on improving the company's quality processes, working together with the team to optimize efficiency and project performance.",
  "softplan-role-p3": "In just 8 months, I stood out as one of those responsible for driving significant improvements in the company's software quality processes. Subsequently, I was assigned to work on the development of web systems in another sector for a year, where I continued to contribute to project success and enhance my technical skills.",
  "wavetech-role-p1": "At Wavetech, I worked on maintaining a hearing aid configuration software, ensuring the system's functionality and usability for professionals in the field.",
  "wavetech-role-p2": "I was involved in the development of a web-based file storage system, employing modern software development methodologies and practices. During this experience, I was able to expand my knowledge in various technologies and contribute to the project's evolution, always seeking innovative and efficient solutions.",
  "wavetech-role-p3": "During my internship at Wavetech, I improved my technical knowledge in various frameworks and technologies, effectively collaborating for the company's project success. This experience provided me with a solid foundation to continually evolve in the software development field, adapting to new demands and challenges that arise in the market.",
  "ifsc-role-p1": "Android Developer Intern. I started implementing an intelligent module to autocomplete typed texts in a shell prompt.",
  "khronos-role-p1": "Perform repairs on residential alarm systems on-site.",
  "angeloni-role-p1": "General confectionery services, bakery attendant, and cashier operator."
}
